routes/web.php

SELECT * FROM `posts` WHERE `posts`.`category_id` = 3 and `posts`.`category_id` IS not NULL
SELECT * FROM `categories`
SELECT * FROM `posts` WHERE `posts`.`category_id` = 2 and `posts`.`category_id` IS not NULL
---
Route::get('/posts', [PostController::class, 'index']);
Route::get('/posts/{post:slug}', [PostController::class, 'show']);

Route::get('/categories', function() {
    return view('categories', [
        'title' => 'Post Categories',
        'active' => 'categories',
        'categories' => Category::all()
    ]);
});