app/Http/Controllers/AdminCategoryController.php

    public function index()
    {
        if (auth()->guest()) {
            abort(403);
        }
        if (auth()->user()->username !== 'faw') {
            abort(403);
        }

        return view('dashboard.categories.index', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`