app/Http/Controllers/DashboardPostController.php

    public function destroy(Post $post)
    {
        Post::destroy($post->id);
        return redirect('/dashboard/posts')->with('success', 'Post has been deleted!');
---
DELETE FROM `posts` WHERE `id` = 21
SELECT * FROM `posts` WHERE `id` in (21)