app/Http/Controllers/DashboardPostController.php

    public function index()
    {
        // return Post::where('user_id', auth()->user()->id)->get();
        return view('dashboard.posts.index', [
            'posts' => Post::where('user_id', auth()->user()->id)->get()
        ]);
---
SELECT * FROM `posts` WHERE `user_id` = 10

    public function create()
    {
        return view('dashboard.posts.create', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`

    public function store(Request $request)
    {
        // return $request->file('image')->store('post-images');

        $validatedData = $request->validate([
            'title' => 'required|max:255',
            'slug' => 'required|unique:posts',
            'category_id' => 'required',
            'image' => 'image|file|max:1024',
            'body' => 'required'
        ]);

        if ($request->file('image')) {
            $validatedData['image'] = $request->file('image')->store('post-images');
        }

        $validatedData['user_id'] = auth()->user()->id;
        $validatedData['excerpt'] = Str::limit(strip_tags($request->body), 200);

        Post::create($validatedData);
---
INSERT INTO `posts` (`title`, `slug`, `category_id`, `image`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) VALUES ('a', 'a', '1', C:\xampp\tmp\php3948.tmp, '<div>a</div>', 1, 'a', '2023-02-07 14:30:49', '2023-02-07 14:30:49')

    public function edit(Post $post)
    {
        return view('dashboard.posts.edit', [
            'post' => $post,
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`

    public function update(Request $request, Post $post)
    {
        $rules = [
            'title' => 'required|max:255',
            'category_id' => 'required',
            'image' => 'image|file|max:1024',
            'body' => 'required'
        ];

        if ($request->slug != $post->slug) {
            $rules['slug'] = 'required|unique:posts';
        }

        $validatedData = $request->validate($rules);

        if ($request->file('image')) {
            if ($request->oldImage) {
                Storage::delete($request->oldImage);
            }
            $validatedData['image'] = $request->file('image')->store('post-images');
        }

        $validatedData['user_id'] = auth()->user()->id;
        $validatedData['excerpt'] = Str::limit(strip_tags($request->body), 200);

        Post::where('id', $post->id)
            ->update($validatedData);
---
UPDATE `posts` SET `title` = 'c', `category_id` = '2', `image` = 'post-images/iwHigz30gSzbDkuYuajk6GipI8VOaY3wftTX7QOo.png', `body` = '<div>c</div>', `user_id` = 1, `excerpt` = 'c', `posts`.`updated_at` = '2023-02-08 12:28:31' WHERE `id` = 23