app/Http/Controllers/RegisterController.php

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'name' => 'required|max:255',
            'username' => ['required', 'min:3', 'max:255', 'unique:users'],
            'email' => 'required|email:dns|unique:users',
            'password' => 'required|min:5|max:255'
        ]);

        // dd('Registrasi Berhasil!');
        // $validatedData['password'] = bcrypt($validatedData['password']);
        $validatedData['password'] = Hash::make($validatedData['password']);

        // $request->session()->flash('success', 'Registration Successfull! Please login');

        User::create($validatedData);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('Tes', 'tes4', 'a4@gmail.com', '$2y$10$aQtkIrU85DnyNedsnTV1eeRbI/sGMBHri2Y4Xs.XmeJWc./I8bPWO', '2023-02-02 14:40:31', '2023-02-02 14:40:31')